Repository: mishamoix/LifeTarget
Catalog: LifeTarget/*.lproj/Localizable.strings
Languages: ru

source: OK
ru: ОК

# task_list
source: Tasks
ru: Задачи

source: Settings
ru: Настройки

source: New task
ru: Новая задача

source: Save
ru: Сохранить

source: Cancel
ru: Отменить

# change_task
source: Modify
ru: Изменение

source: Close
ru: Закрыть

# title_placeholder
source: Task title
ru: Название задачи

# exposition_placeholder
source: Task description
ru: Описание задачи

source: Select date
ru: Выбрать дату

source: Start date
ru: Начало

source: Done
ru: Готово

# delete_date
source: Remove dates
ru: Удалить даты

# you_want_delete_date
source: Do you really want to remove dates?
ru: Вы уверены что хотите удалить даты?

source: Delete
ru: Удалить

source: Current activities
ru: Текущие активности

# max_count_activities_title
source: Max activities
ru: Максимальное количество активностей

# progress_exposition
source: Max activities is a number which represent count of activities. Example: I want read 400 pages of book. I got activity for each page and result is 400.
ru: Максимальное количество активностей - число, которое показывает количество повторений для завершении задачи. Например: Я хочу прочитать книгу из 400 страниц. соотвтественно количество активностей равно 400.

# duration_start_nil
source: Start time is empty
ru: Дата начала - пуста

# duration_finish_nil
source: Deadline is empty
ru: Deadline - пустой

# duration_start_greater_finish
source: Start time is greater than deadline
ru: Дата начала больше чем dedline

# too_much_progress
source: Current max progress number is too big
ru: Количество активностей слишком много

# current_progress_greater_max
source: Current progress greater than max progress
ru: Текущий прогресс больше максимального количества

# empty_title
source: Task title is empty
ru: Пустое название

# validation_error_title
source: Some errors of validation
ru: Некоторые ошибки при валидации

# activities_progress
source: Activities
ru: Активности

# duration_will_start
source: Duration will start at
ru: Начало

# days_progress
source: Days
ru: Дни

# remove_task_title
source: Delete task
ru: Удалить задачу

# remove_task_subtitle
source: Do you really want to remove this task? You will not able to restore task
ru: Вы уверены что хотите удалить эту задачу? Вы не сможете ее восстановить

source: Subtasks
ru: Подзадачи

# complete_button
source: Complete
ru: Завершить

source: Nested level
ru: Уровень вложенности

# main_list_title
source: Main targets
ru: Основные цели

# add_first_task
source: Add task
ru: Добавить задачу

# sure_complete_task_title
source: Task completion
ru: Завершение задачи

# sure_complete_task_subtitle
source: Are you sure you want to complete the task?
ru: Вы уверены что хотите завершить задачу?

source: Is completed
ru: Завершено

source: or
ru: или

# select_date_time
source: Select date and time
ru: Выберите время и дату

source: Select time
ru: Выбрать время

# notification_title
source: Notifications
ru: Уведомления

# notification_exposition
source: Choose exact date and time in order to get notification or choose weekdays and time for periodic notifications.
ru: Выберите точное время и дату что бы получить уведомление или дни недели и время для переодических уведомлений

# lets_start_work_notification
source: Time to work
ru: Время работать

source: Task
ru: Задача

source: Notification
ru: Уведомление

source: every
ru: каждые

# choose_appearance
source: Choose app style
ru: Выберите тему

# appearance_light
source: Light
ru: Светлая

# appearance_dark
source: Dark
ru: Темная

# appearance_system
source: System
ru: Системная

# notification_status
source: Notifications
ru: Уведомления

# notification_status_on
source: On
ru: Вкл.

# notification_status_off
source: Off
ru: Выкл.

# notification_status_none
source: Not requested
ru: Не запрошено

# notification_enable
source: Enable
ru: Включить

# go_to_settings
source: Settings
ru: Настройки

# test_task
source: Example task
ru: Пример задачи

source: Tutorial
ru: Обучение

# write_to_developers
source: Text us
ru: Написать нам

# test_task_title
source: Add example task?
ru: Добавить пример задачи?

# test_task_message
source: Example task will be added at end of you list
ru: Пример будет добавлен в конец списка ваших задач

source: Add
ru: Добавить

# build_version
source: Version
ru: Версия

# example_task_title
source: Learn X language
ru: Выучить язык X

# example_task_exposition
source: This is main target (your global task) it'll take a long time (for example a 1 year).
ru: Это основная цель, может занять длительное время (например 1 год)

# example_task_reading
source: Reading
ru: Чтение

# example_task_reading_exposition
source: This is middle target and accumulate atomic tasks which you will execute every day/week/month.
ru: Эта задача среднего уровня, содержит в себе маленькие позадачки, которые вы выполняете каждый день/неделю/месяц.

# example_task_reading_book
source: Read X book
ru: Прочитать книгу X

# example_task_reading_book_exposition
source: Read 186 pages of book
ru: Прочитать 186 чтраниц книги

# example_task_reading_article
source: Read articles
ru: Прочитать статьи

# example_task_reading_article_exposition
source: Read 10 articles (you can set notification for periodically reading)
ru: Прочитать 10 статей (можете установить нотификацию для переодического чтения)

# example_task_writing
source: Writing
ru: Письмо

# example_task_writing_exposition
source: Use some apps or/and websites
ru: Используй какие либо приложения или сайты

# example_task_writing_people
source: Find 2 peoples
ru: Найти 2 человек

# example_task_writing_people_exposition
source: Find peoples on facebook which help you in texting
ru: Найти людей в facebook для общения

# example_task_writing_blog
source: Write 3 articles
ru: Написать 3 статьи

# example_task_writing_blog_exposition
source: Start a blog and write 3 articles
ru: Завести блог и написать 3 статьи

# example_task_speaking
source: Speaking
ru: Разговор

# example_task_speaking_discord
source: Make 7 sessions of speaking at least 30 min.
ru: Провести 7 разговоров по 30 минут.

# example_task_speaking_discord_exposition
source: Find international community in discord
ru: Найти интарнациональную группу в discord

# example_task_listening
source: Listening
ru: Слушание

# example_task_listening_podcast
source: Listen 8 episodes from X podcast
ru: Прослушать 8 эпизодов из подкаста Х

# example_task_listening_youtube
source: Find channel on youtube and watch 20 videos
ru: Найти на youtube канала и посмотреть 20 видео

# example_task_grammar
source: Grammar
ru: Грамматика

# example_task_word
source: Words
ru: Словарный запас

# example_task_word_exposition
source: We need to learn 2000 words. Use X app to do this (for example you can set notification for every Mon, Fri at 8:00 p.m.)
ru: Нужно выучить 2000 слов. Можно использовать приложения (например установить уведомления на пн и пятницу в 20:00)

source: Example task added
ru: Цель добавлена

# example_task_added_message
source: Switch to targets list and it will appear on end of list
ru: Переключитесь на список задач и там появится пример цели

# tutorial_separate
source: Be smart 🤓. Find out your target and separate it to tasks. Tasks distribute to small subtasks which you can execute every day
ru: 🤓 Определите вашу цель и разбейте ее на задачи, в свою очередь задачи на маленькие подзадачи и выполняйте их каждый день

# tutorial_add
source: Add new subtask or target by ➕ button
ru: Для добавления задачи нажмите кнопку ➕

# tutorial_notification
source: 💌 Setup one-time or periodically notifications
ru: 💌 Устанавливайте переодические уведомления что бы прийти к цели

# tutorial_theme
source: 🌇 Change theme
ru: 🌇 Меняйте тему приложения
